function draw(a, T)
%myFun - Description
%
% Syntax: output = myFun(input)
%
% Long description

    % 画图
    % 四自由度机械臂
    if length(a) == 4 
        link1 = [a(2); 0; 0]; % 杆1在坐标系1下的表达
        link2 = [a(3); 0; 0]; % 杆2在坐标系2下的表达
        link3 = [a(4); 0; 0]; % 杆3在坐标系3下的表达
        d_1 = T{1}(1:3, 1:3) * link1; % 杆1在世界坐标系下的表达
        d_2 = d_1 + T{1}(1:3, 1:3) * T{2}(1:3, 1:3) * link2; % 杆2在世界坐标系下的表达
        d_3 = d_2 + T{1}(1:3, 1:3) * T{2}(1:3, 1:3) * T{3}(1:3, 1:3) * link3; % 杆3在世界坐标系下的表达

        hold on;
        grid on;
        view(45, 30);
        axis equal;
        set(get(gca, 'XLabel'), 'String', 'x轴');
        set(get(gca, 'YLabel'), 'String', 'y轴');
        set(get(gca, 'ZLabel'), 'String', 'z轴');
        plot3(0, 0, 0, 'o');
        plot3(d_1(1), d_1(2), d_1(3), 'o');
        plot3(d_2(1), d_2(2), d_2(3), 'o');
        plot3(d_3(1), d_3(2), d_3(3), 'o');
        % 标出该点空间坐标
        cod = ['(' num2str(d_3(1)) ',' num2str(d_3(2)) ',' num2str(d_3(3)) ')'];
        text(d_3(1), d_3(2), d_3(3), cod);
        % 标出该点空间坐标系
        plot3([d_3(1) (d_3(1) + 100 * T{4}(1, 1))], [d_3(2) (d_3(2) + 100 * T{4}(2, 1))], [d_3(3) (d_3(3) + 100 * T{4}(3, 1))], 'LineStyle', '-.', 'LineWidth', 1, 'color', 'r'); % 红色点划线表示x轴方向
        plot3([d_3(1) (d_3(1) + 100 * T{4}(1, 2))], [d_3(2) (d_3(2) + 100 * T{4}(2, 2))], [d_3(3) (d_3(3) + 100 * T{4}(3, 2))], 'LineStyle', '-.', 'LineWidth', 1, 'color', 'g'); % 绿色点划线表示y轴方向
        plot3([d_3(1) (d_3(1) + 100 * T{4}(1, 3))], [d_3(2) (d_3(2) + 100 * T{4}(2, 3))], [d_3(3) (d_3(3) + 100 * T{4}(3, 3))], 'LineStyle', '-.', 'LineWidth', 1, 'color', 'b'); % 蓝色点划线表示z轴方向
        % 画机械臂
        plot3([0 d_1(1)], [0 d_1(2)], [0 d_1(3)], 'LineWidth', 3, 'color', 'r'); % 底座连杆1用红色表示
        plot3([d_1(1) d_2(1)], [d_1(2) d_2(2)], [d_1(3) d_2(3)], 'LineWidth', 3, 'color', 'b'); % （大臂）连杆2用蓝色表示
        plot3([d_2(1) d_3(1)], [d_2(2) d_3(2)], [d_2(3) d_3(3)], 'LineWidth', 3, 'color', 'g'); % （小臂）连杆3用绿色表示
    end

    % 五自由度机械臂
    if length(a) == 5 
        link1 = [a(2); 0; 0]; % 杆1在坐标系1下的表达
        link2 = [a(3); 0; 0]; % 杆2在坐标系2下的表达
        link3 = [a(4); 0; 0]; % 杆3在坐标系3下的表达
        link4 = [a(5); 0; 0]; % 杆4在坐标系4下的表达
        d_1 = T{1}(1:3, 1:3) * link1; % 杆1在世界坐标系下的表达
        d_2 = d_1 + T{1}(1:3, 1:3) * T{2}(1:3, 1:3) * link2; % 杆2在世界坐标系下的表达
        d_3 = d_2 + T{1}(1:3, 1:3) * T{2}(1:3, 1:3) * T{3}(1:3, 1:3) * link3; % 杆3在世界坐标系下的表达
        d_4 = d_3 + T{1}(1:3, 1:3) * T{2}(1:3, 1:3) * T{3}(1:3, 1:3) * T{4}(1:3, 1:3) * link4; % 杆4在世界坐标系下的表达
        

        hold on;
        grid on;
        view(45, 30);
        %axis([-200 200], [-200 200], [-200 200]);
        axis equal;
        set(get(gca, 'XLabel'), 'String', 'x轴');
        set(get(gca, 'YLabel'), 'String', 'y轴');
        set(get(gca, 'ZLabel'), 'String', 'z轴');
        % axis([-100 100], [-100 100], [-200, 200]);
        plot3(0, 0, 0, 'o');
        plot3(d_1(1), d_1(2), d_1(3), 'o');
        plot3(d_2(1), d_2(2), d_2(3), 'o');
        plot3(d_3(1), d_3(2), d_3(3), 'o');
        plot3(d_4(1), d_4(2), d_4(3), 'o');
        % 标出该点空间坐标
        cod = ['(' num2str(T{5}(1, 4)) ',' num2str(T{5}(2, 4)) ',' num2str(T{5}(3, 4)) ')'];
        text(T{5}(1, 4), T{5}(2, 4), T{5}(3, 4), cod);
        % 标出该点空间坐标系
        plot3([d_4(1) (d_4(1) + 100 * T{5}(1, 1))], [d_4(2) (d_4(2) + 100 * T{5}(2, 1))], [d_4(3) (d_4(3) + 100 * T{5}(3, 1))], 'LineStyle', '-.', 'LineWidth', 1, 'color', 'r'); % 红色点划线表示x轴方向
        plot3([d_4(1) (d_4(1) + 100 * T{5}(1, 2))], [d_4(2) (d_4(2) + 100 * T{5}(2, 2))], [d_4(3) (d_4(3) + 100 * T{5}(3, 2))], 'LineStyle', '-.', 'LineWidth', 1, 'color', 'g'); % 绿色点划线表示y轴方向
        plot3([d_4(1) (d_4(1) + 100 * T{5}(1, 3))], [d_4(2) (d_4(2) + 100 * T{5}(2, 3))], [d_4(3) (d_4(3) + 100 * T{5}(3, 3))], 'LineStyle', '-.', 'LineWidth', 1, 'color', 'b'); % 蓝色点划线表示z轴方向
        % 画机械臂
        plot3([0 d_1(1)], [0 d_1(2)], [0 d_1(3)], 'LineWidth', 3, 'color', 'r'); % 底座连杆1用红色表示
        plot3([d_1(1) d_2(1)], [d_1(2) d_2(2)], [d_1(3) d_2(3)], 'LineWidth', 3, 'color', 'b'); % （大臂）连杆2用蓝色表示
        plot3([d_2(1) d_3(1)], [d_2(2) d_3(2)], [d_2(3) d_3(3)], 'LineWidth', 3, 'color', 'g'); % （小臂）连杆3用绿色表示
        plot3([d_3(1) d_4(1)], [d_3(2) d_4(2)], [d_3(3) d_4(3)], 'LineWidth', 3, 'color', 'k'); 
        plot3([d_4(1) T{5}(1, 4)], [d_4(2) T{5}(2, 4)], [d_4(3) T{5}(3, 4)], 'LineWidth', 3, 'color', 'k')
    end
    
end